# Prepare phase texts
GLOBAL_LOAD_GAME = "Загрузка игры"
GLOBAL_FIRST_TURN = "Первым будет ходить [активного плеера]"
ACT_PASS_YOUR_ROLE = "Ваша роль – [полученная роль]. Ваша задача, обнаружить вашего противника и нейтрализовать его раньше, чем это сделает он. Будьте расчетливым, непредсказуемым и коварным убийцей. Удачи!"
GLOBAL_START_GAME = "Игра началась!"

# Night status texts
ACT_PASS_NIGHT_NUMBER = "НОЧЬ [номер ночи]"
PASS_ENEMY_TURN = "Ход противника"
ACT_YOUR_TURN = "Ваш ход"
ACT_HP_COUNT = "HP"
ACT_IS_STAGING = "Наличие Инсценировки: "
ACT_PERSONAL_CARD = "Личная карта: "
ACT_STOLEN_CARDS = "Украденные карты: "
ACT_DIE = " (мертв)"

# Night action creation texts
ACT_CHOOSE_ACTION_NUMBER = "Введите номер действия: \n 1. [Убийство]” / “2. [Кража]” / “3. [Инсценировка]"
ACT_CHOOSE_KILL_TARGET = "Выберите цель, на которую будет совершено покушение на убийство в эту ночь:"
ACT_CHOOSE_STEAL_TARGET = "Выберите цель, которую вы попытаетесь ограбить в эту ночь:"
ACT_CHOOSE_STAGING_TARGET = "Выберите цель, с которой вы поменяетесь ролями в эту ночь (в новостях объявят о гибели гражданина с вашей предыдущей ролью):"
ACT_CHOOSE_CARD_NUMBER = "Введите номер карты:"

# Cards targets texts
ACT_CARD_DATABASE_TARGET = "Выберите три цели, которые будут проанализированы с помощью базы данных:"
ACT_CARD_TALES_TARGET = "Выберите ночь, информация о которой будет предоставлена:"
ACT_CARD_CAMERA_TARGET = "Выберите гражданина, на дом которого будет установлена Видеокамера:"
ACT_CARD_BITCH_TARGET = "Выберите гражданина, которого сегодня посетит Жрица Любви:"
ACT_CARD_ALARM_TARGET = "Выберите гражданина, на дом которого будет установлена Система Тревоги:"
ACT_CARD_TRAP_TARGET = "Выберите гражданина, на дом которого будет установлена Ловушка:"
ACT_CARD_WITNESSDEF_TARGET = "Выберите гражданина, на дом которого будет установлена Защита свидетеля:"
ACT_CARD_THEATRESTUFF_TARGET = "Выберите гражданина, роль которого будет теперь отображаться вместо вашей при анализе с помощью эффектов обнаружения:"
ACT_CARD_DRUGS_TARGET = "Выберите гражданина, к дому которого будет отправлен Наркоман:"
ACT_CARD_ANONYMOUSCALL_TARGET = "Выберите гражданина, которого сегодняшней ночью неизвестный обвинит с помощью анонимного звонка в полицию:"
ACT_CARD_TAXES_TARGET = "Выберите гражданина, которого сегодня посетит Соцработник:"
ACT_CARD_ANTIDOTE_TARGET = "Выберите гражданина, который следующий ход будет защищен от смертельной атаки:"
ACT_CARD_GANG_TARGET = "Банда вышла на охоту и следующий ход никто не посмеет помешать вашим планам."

# General day news
GLOBAL_DAY_NUMBER = "ДЕНЬ [номер дня]"
GLOBAL_KILL_CITIZEN = "Ночь была неспокойной. Был хладнокровно убит [имя персонажа убитого гражданина]. Весь город скорбит."
GLOBAL_STEAL_CITIZEN = "Эта ночь прошла спокойно."
GLOBAL_KILL_PLAYER = "Ночь была неспокойной. Было совершено покушение на [имя персонажа противника]. [имя персонажа противника] чудом удалось спастись."
ACT_PASS_LOST_HP = "Вы потеряли 1 HP"
GLOBAL_KILL_SPY = "Ночь была неспокойной. [имя персонажа противника] оказался не тем за кого себя выдавал. Шпион, который скрывался под личиной [имя персонажа противника] в спешке покинул город."

# General effects of some cards
GLOBAL_BITCH_ACTIVATED = "На охоту вышла Ночная Бабочка, готовая, следующей ночью, одарить одного из горожан своим визитом."
GLOBAL_TRAP_RESOLVED = "В дом [имя целевого гражданина] вломился неизвестный, но оказался в западне."
GLOBAL_WITNESSDEF_ACTIVATED = "Городская полиция оцепила один из домов. Говорят, что они нашли ценного свидетеля по делу городских убийств."
GLOBAL_WITNESSDEF_RESOLVED = "В дом [имя целевого гражданина] вломился неизвестный, но был остановлен доблестными стражами закона."
GLOBAL_ANONYMOUSCALL_ACTIVATED = "В полицию поступил загадочный анонимный звонок, где высказывались обвинения в убийстве с указанием конкретного подозреваемого. Полиция решила перепроверить данную информацию"

# Night results
ACT_STEAL_SUCCESSFULL = "Вы получили карту [Название карты]."
ACT_STEAL_UNSUCCESSFULL = "Вы проникли в дом [целевой гражданин], но карту обнаружить вам не удалось."
ACT_STAGING_CITIZEN = "Инсценировка удалась, ваша новая роль [ роль гражданина, на которого была осуществлена инсценировка]."
ACT_STAGING_PLAYER = "К сожалению, вам не удалось инсценировать свою смерть, однако противник пострадал в ходе ваших действий."
PASS_LOST_CARD = "Ваша карта была украдена"

# Cards effects
ACT_CAMERA_ACTIVATED = "Видеокамера была установлена на дом гражданина - [имя целевого гражданина]."
ACT_BITCH_ACTIVATED = "Жрица Любви отправилась в дом гражданина - [имя целевого гражданина]."
ACT_ALARM_ACTIVATED = "Система тревоги была установлена на дом гражданина - [имя целевого гражданина]."
ACT_TRAP_ACTIVATED = "Ловушка была установлена на дом гражданина - [имя целевого гражданина]."
ACT_WITNESSDEF_ACTIVATED = "Защита свидетеля была установлена на дом гражданина - [имя целевого гражданина]."
ACT_THEATRESTUFF_ACTIVATED = "Вы успешно использовали театральный реквизит. Ваша новая роль - [имя целевого гражданина]."
ACT_DRUGS_ACTIVATED = "Наркоман успешно устроил диверсию в доме гражданина - [имя целевого гражданина]."
ACT_TAXES_ACTIVATED = "Вы отправили Соцработника в дом гражданина - [имя целевого гражданина]."
ACT_ANTIDOTE_ACTIVATED = "Вы использовали Антидот на гражданина - [имя гражданина]."
ACT_DATABASE_NO_SUSPECT_RESOLVED = "База данных показала, что среди указанных граждан нет подозрительных личностей."
ACT_DATABASE_FIND_PLAYER_RESOLVED = "База данных показала, что среди указанных граждан есть Убийца."
ACT_DATABASE_FIND_SPY_RESOLVED = "База данных показала, что среди указанных граждан есть Шпион."
ACT_DATABASE_FIND_ALL_RESOLVED = "База данных показала, что среди указанных граждан есть Убийца и Шпион."
ACT_TALES_RESOLVED = "В этот ход противник сделал следующее: [лог действий противника за целевой ход]"
ACT_CAMERA_RESOLVED = "Видеокамера зафиксировала как [роль игрока, который осуществил Убийство или Кражу] вломился в дом [целевой гражданин]."
PASS_BITCH_RESOLVED = "Следующую ночь вы проведете с очаровательной красоткой и не сможете совершать действие Убийства, Кражи или Инсценировки."
PASS_ALARM_RESOLVED = "Вы активировали Систему Тревоги, поэтому были вынуждены броситься в бегство."
ACT_TRAP_RESOLVED = "Вы попали в Ловушку, ваше действие было прервано"
ACT_THEATRESTUFF_RESOLVED = "Ваша новая роль – [роль целевого гражданина]. Сыграйте ее достойно!"
ACT_ANONYMOUSCALL_NO_SUSPECT_RESOLVED = "Полиция проверила дом гражданина - [номер целевого гражданина]. Достоверно, что он не является подозрительным."
ACT_ANONYMOUSCALL_PLAYER_RESOLVED = "Полиция проверила дом гражданина - [номер целевого гражданина]. Достоверно, что он является Убийцей."
ACT_ANONYMOUSCALL_SPY_RESOLVED = "Полиция проверила дом гражданина - [номер целевого гражданина]. Достоверно, что он является Шпионом."
ACT_TAXES_PLAYER_CHOOSE_VARIANT = "Этой ночью вас посетил жадный Соцработник. Выберите способ откупиться от него: \n [1.Карта, 2.HP]"
ACT_TAXES_PLAYER_CHOOSE_CARD = "Выберите карту: \n [номера карт игрока]"
ACT_TAXES_RESOLVED = "Соцработник покинул вас, доставив немало хлопот."
ACT_ANTIDOTE_RESOLVED = "Препарат нового поколения спас гражданина [имя гражданина] от неминуемой смерти"
ACT_GANG_RESOLVED = "Банда изрядно поколотила вас в эту ночь, не дав возможность осуществить задуманное."

# Finish turn
ACT_FINISH_TURN = "Ваш ход завершен!"

# Errors texts
ERROR_ACTION_CHOICE = "Ошибка! Введите номер доступного действия."
ERROR_CARD_CHOICE = "Ошибка! Введите номер доступной карты."
ERROR_TARGET = "Ошибка! Введите номер доступной цели."
ERROR_CARDS_ONE_TARGET = "Ошибка! Введите одну цель для выбранной карты."
ERROR_DATA_BASE_TARGETS = "Ошибка! Введите три цели для выбранной карты."
ERROR_TALES_TARGET = "Ошибка! Целью для карты Сплетни является номер ночи. Введите номер доступной ночи."
